knieriem/tinygo-stm32-svd/svd/stm32u5gx.svd
          <register>
            <name>GFXMMU_LUT71L</name>
            <displayName>GFXMMU_LUT71L</displayName>
            <description>GFXMMU LUT entry 71 low</description>
            <addressOffset>0x1238</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable
Line enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block
Number of the first valid block of line number x.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block
Number of the last valid block of line number X.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT71H</name>
            <displayName>GFXMMU_LUT71H</displayName>
            <description>GFXMMU LUT entry 71 high</description>
            <addressOffset>0x123c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset
Line offset of line number x (i.e. offset of block 0 of line x)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT72L</name>
            <displayName>GFXMMU_LUT72L</displayName>
            <description>GFXMMU LUT entry 72 low</description>
            <addressOffset>0x1240</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable
Line enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block
Number of the first valid block of line number x.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block
Number of the last valid block of line number X.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT72H</name>
            <displayName>GFXMMU_LUT72H</displayName>
            <description>GFXMMU LUT entry 72 high</description>
            <addressOffset>0x1244</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset
Line offset of line number x (i.e. offset of block 0 of line x)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT73L</name>
            <displayName>GFXMMU_LUT73L</displayName>
            <description>GFXMMU LUT entry 73 low</description>
            <addressOffset>0x1248</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable
Line enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block
Number of the first valid block of line number x.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block
Number of the last valid block of line number X.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT73H</name>
            <displayName>GFXMMU_LUT73H</displayName>
            <description>GFXMMU LUT entry 73 high</description>
            <addressOffset>0x124c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset
Line offset of line number x (i.e. offset of block 0 of line x)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT74L</name>
            <displayName>GFXMMU_LUT74L</displayName>
            <description>GFXMMU LUT entry 74 low</description>
            <addressOffset>0x1250</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable
Line enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block
Number of the first valid block of line number x.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block
Number of the last valid block of line number X.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT74H</name>
            <displayName>GFXMMU_LUT74H</displayName>
            <description>GFXMMU LUT entry 74 high</description>
            <addressOffset>0x1254</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset
Line offset of line number x (i.e. offset of block 0 of line x)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT75L</name>
            <displayName>GFXMMU_LUT75L</displayName>
            <description>GFXMMU LUT entry 75 low</description>
            <addressOffset>0x1258</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable
Line enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block
Number of the first valid block of line number x.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block
Number of the last valid block of line number X.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT75H</name>
            <displayName>GFXMMU_LUT75H</displayName>
            <description>GFXMMU LUT entry 75 high</description>
            <addressOffset>0x125c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset
Line offset of line number x (i.e. offset of block 0 of line x)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT76L</name>
            <displayName>GFXMMU_LUT76L</displayName>
            <description>GFXMMU LUT entry 76 low</description>
            <addressOffset>0x1260</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable
Line enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block
Number of the first valid block of line number x.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block
Number of the last valid block of line number X.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT76H</name>
            <displayName>GFXMMU_LUT76H</displayName>
            <description>GFXMMU LUT entry 76 high</description>
            <addressOffset>0x1264</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset
Line offset of line number x (i.e. offset of block 0 of line x)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT77L</name>
            <displayName>GFXMMU_LUT77L</displayName>
            <description>GFXMMU LUT entry 77 low</description>
            <addressOffset>0x1268</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable
Line enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block
Number of the first valid block of line number x.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block
Number of the last valid block of line number X.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT77H</name>
            <displayName>GFXMMU_LUT77H</displayName>
            <description>GFXMMU LUT entry 77 high</description>
            <addressOffset>0x126c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset
Line offset of line number x (i.e. offset of block 0 of line x)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT78L</name>
            <displayName>GFXMMU_LUT78L</displayName>
            <description>GFXMMU LUT entry 78 low</description>
            <addressOffset>0x1270</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable
Line enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block
Number of the first valid block of line number x.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block
Number of the last valid block of line number X.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT78H</name>
            <displayName>GFXMMU_LUT78H</displayName>
            <description>GFXMMU LUT entry 78 high</description>
            <addressOffset>0x1274</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset
Line offset of line number x (i.e. offset of block 0 of line x)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT79L</name>
            <displayName>GFXMMU_LUT79L</displayName>
            <description>GFXMMU LUT entry 79 low</description>
            <addressOffset>0x1278</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable
Line enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block
Number of the first valid block of line number x.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block
Number of the last valid block of line number X.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT79H</name>
            <displayName>GFXMMU_LUT79H</displayName>
            <description>GFXMMU LUT entry 79 high</description>
            <addressOffset>0x127c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset
Line offset of line number x (i.e. offset of block 0 of line x)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
