knieriem/tinygo-stm32-svd/svd/stm32u5gx.svd
        <register>
          <name>GPDMA_C5FCR</name>
          <displayName>GPDMA_C5FCR</displayName>
          <description>GPDMA channel x flag clear register</description>
          <addressOffset>0x2DC</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCF</name>
              <description>transfer complete flag clear - 0: no effect - 1: clears the corresponding TCF flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTF</name>
              <description>half transfer flag clear - 0: no effect - 1: clears the corresponding HTF flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTEF</name>
              <description>data transfer error flag clear - 0: no effect - 1: clears the corresponding DTEF flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULEF</name>
              <description>update link transfer error flag clear - 0: no effect - 1: clears the corresponding ULEF flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USEF</name>
              <description>user setting error flag clear - 0: no effect - 1: clears the corresponding USEF flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPF</name>
              <description>completed suspension flag clear - 0: no effect - 1: clears the corresponding SUSPF flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOF</name>
              <description>trigger overrun flag clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C6FCR</name>
          <displayName>GPDMA_C6FCR</displayName>
          <description>GPDMA channel x flag clear register</description>
          <addressOffset>0x35C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCF</name>
              <description>transfer complete flag clear - 0: no effect - 1: clears the corresponding TCF flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTF</name>
              <description>half transfer flag clear - 0: no effect - 1: clears the corresponding HTF flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTEF</name>
              <description>data transfer error flag clear - 0: no effect - 1: clears the corresponding DTEF flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULEF</name>
              <description>update link transfer error flag clear - 0: no effect - 1: clears the corresponding ULEF flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USEF</name>
              <description>user setting error flag clear - 0: no effect - 1: clears the corresponding USEF flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPF</name>
              <description>completed suspension flag clear - 0: no effect - 1: clears the corresponding SUSPF flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOF</name>
              <description>trigger overrun flag clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C7FCR</name>
          <displayName>GPDMA_C7FCR</displayName>
          <description>GPDMA channel x flag clear register</description>
          <addressOffset>0x3DC</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCF</name>
              <description>transfer complete flag clear - 0: no effect - 1: clears the corresponding TCF flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTF</name>
              <description>half transfer flag clear - 0: no effect - 1: clears the corresponding HTF flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTEF</name>
              <description>data transfer error flag clear - 0: no effect - 1: clears the corresponding DTEF flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULEF</name>
              <description>update link transfer error flag clear - 0: no effect - 1: clears the corresponding ULEF flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USEF</name>
              <description>user setting error flag clear - 0: no effect - 1: clears the corresponding USEF flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPF</name>
              <description>completed suspension flag clear - 0: no effect - 1: clears the corresponding SUSPF flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOF</name>
              <description>trigger overrun flag clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C8FCR</name>
          <displayName>GPDMA_C8FCR</displayName>
          <description>GPDMA channel x flag clear register</description>
          <addressOffset>0x45C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCF</name>
              <description>transfer complete flag clear - 0: no effect - 1: clears the corresponding TCF flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTF</name>
              <description>half transfer flag clear - 0: no effect - 1: clears the corresponding HTF flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTEF</name>
              <description>data transfer error flag clear - 0: no effect - 1: clears the corresponding DTEF flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULEF</name>
              <description>update link transfer error flag clear - 0: no effect - 1: clears the corresponding ULEF flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USEF</name>
              <description>user setting error flag clear - 0: no effect - 1: clears the corresponding USEF flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPF</name>
              <description>completed suspension flag clear - 0: no effect - 1: clears the corresponding SUSPF flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOF</name>
              <description>trigger overrun flag clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C9FCR</name>
          <displayName>GPDMA_C9FCR</displayName>
          <description>GPDMA channel x flag clear register</description>
          <addressOffset>0x4DC</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCF</name>
              <description>transfer complete flag clear - 0: no effect - 1: clears the corresponding TCF flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTF</name>
              <description>half transfer flag clear - 0: no effect - 1: clears the corresponding HTF flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTEF</name>
              <description>data transfer error flag clear - 0: no effect - 1: clears the corresponding DTEF flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULEF</name>
              <description>update link transfer error flag clear - 0: no effect - 1: clears the corresponding ULEF flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USEF</name>
              <description>user setting error flag clear - 0: no effect - 1: clears the corresponding USEF flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPF</name>
              <description>completed suspension flag clear - 0: no effect - 1: clears the corresponding SUSPF flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOF</name>
              <description>trigger overrun flag clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C10FCR</name>
          <displayName>GPDMA_C10FCR</displayName>
          <description>GPDMA channel x flag clear register</description>
          <addressOffset>0x55C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCF</name>
              <description>transfer complete flag clear - 0: no effect - 1: clears the corresponding TCF flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTF</name>
              <description>half transfer flag clear - 0: no effect - 1: clears the corresponding HTF flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTEF</name>
              <description>data transfer error flag clear - 0: no effect - 1: clears the corresponding DTEF flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULEF</name>
              <description>update link transfer error flag clear - 0: no effect - 1: clears the corresponding ULEF flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USEF</name>
              <description>user setting error flag clear - 0: no effect - 1: clears the corresponding USEF flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPF</name>
              <description>completed suspension flag clear - 0: no effect - 1: clears the corresponding SUSPF flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOF</name>
              <description>trigger overrun flag clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C11FCR</name>
          <displayName>GPDMA_C11FCR</displayName>
          <description>GPDMA channel x flag clear register</description>
          <addressOffset>0x5DC</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCF</name>
              <description>transfer complete flag clear - 0: no effect - 1: clears the corresponding TCF flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTF</name>
              <description>half transfer flag clear - 0: no effect - 1: clears the corresponding HTF flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTEF</name>
              <description>data transfer error flag clear - 0: no effect - 1: clears the corresponding DTEF flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULEF</name>
              <description>update link transfer error flag clear - 0: no effect - 1: clears the corresponding ULEF flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USEF</name>
              <description>user setting error flag clear - 0: no effect - 1: clears the corresponding USEF flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPF</name>
              <description>completed suspension flag clear - 0: no effect - 1: clears the corresponding SUSPF flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOF</name>
              <description>trigger overrun flag clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C12FCR</name>
          <displayName>GPDMA_C12FCR</displayName>
          <description>GPDMA channel x flag clear register</description>
          <addressOffset>0x65C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCF</name>
              <description>transfer complete flag clear - 0: no effect - 1: clears the corresponding TCF flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTF</name>
              <description>half transfer flag clear - 0: no effect - 1: clears the corresponding HTF flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTEF</name>
              <description>data transfer error flag clear - 0: no effect - 1: clears the corresponding DTEF flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULEF</name>
              <description>update link transfer error flag clear - 0: no effect - 1: clears the corresponding ULEF flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USEF</name>
              <description>user setting error flag clear - 0: no effect - 1: clears the corresponding USEF flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPF</name>
              <description>completed suspension flag clear - 0: no effect - 1: clears the corresponding SUSPF flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOF</name>
              <description>trigger overrun flag clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C13FCR</name>
          <displayName>GPDMA_C13FCR</displayName>
          <description>GPDMA channel x flag clear register</description>
          <addressOffset>0x6DC</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCF</name>
              <description>transfer complete flag clear - 0: no effect - 1: clears the corresponding TCF flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTF</name>
              <description>half transfer flag clear - 0: no effect - 1: clears the corresponding HTF flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTEF</name>
              <description>data transfer error flag clear - 0: no effect - 1: clears the corresponding DTEF flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULEF</name>
              <description>update link transfer error flag clear - 0: no effect - 1: clears the corresponding ULEF flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USEF</name>
              <description>user setting error flag clear - 0: no effect - 1: clears the corresponding USEF flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPF</name>
              <description>completed suspension flag clear - 0: no effect - 1: clears the corresponding SUSPF flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOF</name>
              <description>trigger overrun flag clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C14FCR</name>
          <displayName>GPDMA_C14FCR</displayName>
          <description>GPDMA channel x flag clear register</description>
          <addressOffset>0x75C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCF</name>
              <description>transfer complete flag clear - 0: no effect - 1: clears the corresponding TCF flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTF</name>
              <description>half transfer flag clear - 0: no effect - 1: clears the corresponding HTF flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTEF</name>
              <description>data transfer error flag clear - 0: no effect - 1: clears the corresponding DTEF flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULEF</name>
              <description>update link transfer error flag clear - 0: no effect - 1: clears the corresponding ULEF flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USEF</name>
              <description>user setting error flag clear - 0: no effect - 1: clears the corresponding USEF flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPF</name>
              <description>completed suspension flag clear - 0: no effect - 1: clears the corresponding SUSPF flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOF</name>
              <description>trigger overrun flag clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
