knieriem/tinygo-stm32-svd/svd/stm32u5gx.svd
          <register>
            <name>JPEG_QMEM3_2</name>
            <displayName>JPEG_QMEM3_2</displayName>
            <description>JPEG quantization memory 3</description>
            <addressOffset>0x118</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>QCOEF8</name>
                <description>Quantization coefficient 8
8-bit quantization coefficient.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF9</name>
                <description>Quantization coefficient 9
8-bit quantization coefficient.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF10</name>
                <description>Quantization coefficient 10
8-bit quantization coefficient.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF11</name>
                <description>Quantization coefficient 11
8-bit quantization coefficient.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_QMEM3_3</name>
            <displayName>JPEG_QMEM3_3</displayName>
            <description>JPEG quantization memory 3</description>
            <addressOffset>0x11C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>QCOEF12</name>
                <description>Quantization coefficient 12
8-bit quantization coefficient.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF13</name>
                <description>Quantization coefficient 13
8-bit quantization coefficient.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF14</name>
                <description>Quantization coefficient 14
8-bit quantization coefficient.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF15</name>
                <description>Quantization coefficient 15
8-bit quantization coefficient.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_QMEM3_4</name>
            <displayName>JPEG_QMEM3_4</displayName>
            <description>JPEG quantization memory 3</description>
            <addressOffset>0x120</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>QCOEF16</name>
                <description>Quantization coefficient 16
8-bit quantization coefficient.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF17</name>
                <description>Quantization coefficient 17
8-bit quantization coefficient.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF18</name>
                <description>Quantization coefficient 18
8-bit quantization coefficient.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF19</name>
                <description>Quantization coefficient 19
8-bit quantization coefficient.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_QMEM3_5</name>
            <displayName>JPEG_QMEM3_5</displayName>
            <description>JPEG quantization memory 3</description>
            <addressOffset>0x124</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>QCOEF20</name>
                <description>Quantization coefficient 20
8-bit quantization coefficient.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF21</name>
                <description>Quantization coefficient 21
8-bit quantization coefficient.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF22</name>
                <description>Quantization coefficient 22
8-bit quantization coefficient.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF23</name>
                <description>Quantization coefficient 23
8-bit quantization coefficient.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_QMEM3_6</name>
            <displayName>JPEG_QMEM3_6</displayName>
            <description>JPEG quantization memory 3</description>
            <addressOffset>0x128</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>QCOEF24</name>
                <description>Quantization coefficient 24
8-bit quantization coefficient.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF25</name>
                <description>Quantization coefficient 25
8-bit quantization coefficient.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF26</name>
                <description>Quantization coefficient 26
8-bit quantization coefficient.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF27</name>
                <description>Quantization coefficient 27
8-bit quantization coefficient.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_QMEM3_7</name>
            <displayName>JPEG_QMEM3_7</displayName>
            <description>JPEG quantization memory 3</description>
            <addressOffset>0x12C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>QCOEF28</name>
                <description>Quantization coefficient 28
8-bit quantization coefficient.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF29</name>
                <description>Quantization coefficient 29
8-bit quantization coefficient.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF30</name>
                <description>Quantization coefficient 30
8-bit quantization coefficient.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF31</name>
                <description>Quantization coefficient 31
8-bit quantization coefficient.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_QMEM3_8</name>
            <displayName>JPEG_QMEM3_8</displayName>
            <description>JPEG quantization memory 3</description>
            <addressOffset>0x130</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>QCOEF32</name>
                <description>Quantization coefficient 32
8-bit quantization coefficient.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF33</name>
                <description>Quantization coefficient 33
8-bit quantization coefficient.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF34</name>
                <description>Quantization coefficient 34
8-bit quantization coefficient.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF35</name>
                <description>Quantization coefficient 35
8-bit quantization coefficient.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_QMEM3_9</name>
            <displayName>JPEG_QMEM3_9</displayName>
            <description>JPEG quantization memory 3</description>
            <addressOffset>0x134</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>QCOEF36</name>
                <description>Quantization coefficient 36
8-bit quantization coefficient.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF37</name>
                <description>Quantization coefficient 37
8-bit quantization coefficient.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF38</name>
                <description>Quantization coefficient 38
8-bit quantization coefficient.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF39</name>
                <description>Quantization coefficient 39
8-bit quantization coefficient.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_QMEM3_10</name>
            <displayName>JPEG_QMEM3_10</displayName>
            <description>JPEG quantization memory 3</description>
            <addressOffset>0x138</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>QCOEF40</name>
                <description>Quantization coefficient 40
8-bit quantization coefficient.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF41</name>
                <description>Quantization coefficient 41
8-bit quantization coefficient.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF42</name>
                <description>Quantization coefficient 42
8-bit quantization coefficient.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF43</name>
                <description>Quantization coefficient 43
8-bit quantization coefficient.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_QMEM3_11</name>
            <displayName>JPEG_QMEM3_11</displayName>
            <description>JPEG quantization memory 3</description>
            <addressOffset>0x13C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>QCOEF44</name>
                <description>Quantization coefficient 44
8-bit quantization coefficient.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF45</name>
                <description>Quantization coefficient 45
8-bit quantization coefficient.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF46</name>
                <description>Quantization coefficient 46
8-bit quantization coefficient.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF47</name>
                <description>Quantization coefficient 47
8-bit quantization coefficient.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_QMEM3_12</name>
            <displayName>JPEG_QMEM3_12</displayName>
            <description>JPEG quantization memory 3</description>
            <addressOffset>0x140</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>QCOEF48</name>
                <description>Quantization coefficient 48
8-bit quantization coefficient.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF49</name>
                <description>Quantization coefficient 49
8-bit quantization coefficient.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF50</name>
                <description>Quantization coefficient 50
8-bit quantization coefficient.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF51</name>
                <description>Quantization coefficient 51
8-bit quantization coefficient.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_QMEM3_13</name>
            <displayName>JPEG_QMEM3_13</displayName>
            <description>JPEG quantization memory 3</description>
            <addressOffset>0x144</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>QCOEF52</name>
                <description>Quantization coefficient 52
8-bit quantization coefficient.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF53</name>
                <description>Quantization coefficient 53
8-bit quantization coefficient.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF54</name>
                <description>Quantization coefficient 54
8-bit quantization coefficient.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF55</name>
                <description>Quantization coefficient 55
8-bit quantization coefficient.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_QMEM3_14</name>
            <displayName>JPEG_QMEM3_14</displayName>
            <description>JPEG quantization memory 3</description>
            <addressOffset>0x148</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>QCOEF56</name>
                <description>Quantization coefficient 56
8-bit quantization coefficient.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF57</name>
                <description>Quantization coefficient 57
8-bit quantization coefficient.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF58</name>
                <description>Quantization coefficient 58
8-bit quantization coefficient.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF59</name>
                <description>Quantization coefficient 59
8-bit quantization coefficient.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_QMEM3_15</name>
            <displayName>JPEG_QMEM3_15</displayName>
            <description>JPEG quantization memory 3</description>
            <addressOffset>0x14C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>QCOEF60</name>
                <description>Quantization coefficient 60
8-bit quantization coefficient.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF61</name>
                <description>Quantization coefficient 61
8-bit quantization coefficient.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF62</name>
                <description>Quantization coefficient 62
8-bit quantization coefficient.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>QCOEF63</name>
                <description>Quantization coefficient 63
8-bit quantization coefficient.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFMIN0_0</name>
            <displayName>JPEG_HUFFMIN0_0</displayName>
            <description>JPEG Huffman min</description>
            <addressOffset>0x150</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA0</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
