knieriem/tinygo-stm32-svd/svd/stm32u5gx.svd
          <register>
            <name>JPEG_HUFFSYMB3</name>
            <displayName>JPEG_HUFFSYMB3</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x21C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA12</name>
                <description>Data 12
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA13</name>
                <description>Data 13
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA14</name>
                <description>Data 14
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA15</name>
                <description>Data 15
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB4</name>
            <displayName>JPEG_HUFFSYMB4</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x220</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA16</name>
                <description>Data 16
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA17</name>
                <description>Data 17
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA18</name>
                <description>Data 18
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA19</name>
                <description>Data 19
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB5</name>
            <displayName>JPEG_HUFFSYMB5</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x224</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA20</name>
                <description>Data 20
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA21</name>
                <description>Data 21
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA22</name>
                <description>Data 22
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA23</name>
                <description>Data 23
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB6</name>
            <displayName>JPEG_HUFFSYMB6</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x228</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA24</name>
                <description>Data 24
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA25</name>
                <description>Data 25
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA26</name>
                <description>Data 26
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA27</name>
                <description>Data 27
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB7</name>
            <displayName>JPEG_HUFFSYMB7</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x22C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA28</name>
                <description>Data 28
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA29</name>
                <description>Data 29
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA30</name>
                <description>Data 30
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA31</name>
                <description>Data 31
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB8</name>
            <displayName>JPEG_HUFFSYMB8</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x230</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA32</name>
                <description>Data 32
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA33</name>
                <description>Data 33
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA34</name>
                <description>Data 34
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA35</name>
                <description>Data 35
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB9</name>
            <displayName>JPEG_HUFFSYMB9</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x234</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA36</name>
                <description>Data 36
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA37</name>
                <description>Data 37
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA38</name>
                <description>Data 38
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA39</name>
                <description>Data 39
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB10</name>
            <displayName>JPEG_HUFFSYMB10</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x238</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA40</name>
                <description>Data 40
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA41</name>
                <description>Data 41
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA42</name>
                <description>Data 42
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA43</name>
                <description>Data 43
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB11</name>
            <displayName>JPEG_HUFFSYMB11</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x23C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA44</name>
                <description>Data 44
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA45</name>
                <description>Data 45
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA46</name>
                <description>Data 46
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA47</name>
                <description>Data 47
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB12</name>
            <displayName>JPEG_HUFFSYMB12</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x240</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA48</name>
                <description>Data 48
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA49</name>
                <description>Data 49
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA50</name>
                <description>Data 50
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA51</name>
                <description>Data 51
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB13</name>
            <displayName>JPEG_HUFFSYMB13</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x244</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA52</name>
                <description>Data 52
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA53</name>
                <description>Data 53
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA54</name>
                <description>Data 54
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA55</name>
                <description>Data 55
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB14</name>
            <displayName>JPEG_HUFFSYMB14</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x248</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA56</name>
                <description>Data 56
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA57</name>
                <description>Data 57
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA58</name>
                <description>Data 58
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA59</name>
                <description>Data 59
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB15</name>
            <displayName>JPEG_HUFFSYMB15</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x24C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA60</name>
                <description>Data 60
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA61</name>
                <description>Data 61
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA62</name>
                <description>Data 62
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA63</name>
                <description>Data 63
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB16</name>
            <displayName>JPEG_HUFFSYMB16</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x250</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA64</name>
                <description>Data 64
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA65</name>
                <description>Data 65
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA66</name>
                <description>Data 66
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA67</name>
                <description>Data 67
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB17</name>
            <displayName>JPEG_HUFFSYMB17</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x254</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA68</name>
                <description>Data 68
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA69</name>
                <description>Data 69
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA70</name>
                <description>Data 70
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA71</name>
                <description>Data 71
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
