knieriem/tinygo-stm32-svd/svd/stm32u5gx.svd
          <register>
            <name>JPEG_HUFFSYMB33</name>
            <displayName>JPEG_HUFFSYMB33</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x294</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA132</name>
                <description>Data 132
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA133</name>
                <description>Data 133
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA134</name>
                <description>Data 134
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA135</name>
                <description>Data 135
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB34</name>
            <displayName>JPEG_HUFFSYMB34</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x298</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA136</name>
                <description>Data 136
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA137</name>
                <description>Data 137
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA138</name>
                <description>Data 138
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA139</name>
                <description>Data 139
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB35</name>
            <displayName>JPEG_HUFFSYMB35</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x29C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA140</name>
                <description>Data 140
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA141</name>
                <description>Data 141
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA142</name>
                <description>Data 142
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA143</name>
                <description>Data 143
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB36</name>
            <displayName>JPEG_HUFFSYMB36</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x2A0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA144</name>
                <description>Data 144
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA145</name>
                <description>Data 145
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA146</name>
                <description>Data 146
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA147</name>
                <description>Data 147
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB37</name>
            <displayName>JPEG_HUFFSYMB37</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x2A4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA148</name>
                <description>Data 148
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA149</name>
                <description>Data 149
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA150</name>
                <description>Data 150
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA151</name>
                <description>Data 151
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB38</name>
            <displayName>JPEG_HUFFSYMB38</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x2A8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA152</name>
                <description>Data 152
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA153</name>
                <description>Data 153
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA154</name>
                <description>Data 154
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA155</name>
                <description>Data 155
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB39</name>
            <displayName>JPEG_HUFFSYMB39</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x2AC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA156</name>
                <description>Data 156
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA157</name>
                <description>Data 157
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA158</name>
                <description>Data 158
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA159</name>
                <description>Data 159
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB40</name>
            <displayName>JPEG_HUFFSYMB40</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x2B0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA160</name>
                <description>Data 160
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA161</name>
                <description>Data 161
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA162</name>
                <description>Data 162
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA163</name>
                <description>Data 163
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB41</name>
            <displayName>JPEG_HUFFSYMB41</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x2B4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA164</name>
                <description>Data 164
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA165</name>
                <description>Data 165
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA166</name>
                <description>Data 166
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA167</name>
                <description>Data 167
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB42</name>
            <displayName>JPEG_HUFFSYMB42</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x2B8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA168</name>
                <description>Data 168
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA169</name>
                <description>Data 169
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA170</name>
                <description>Data 170
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA171</name>
                <description>Data 171
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB43</name>
            <displayName>JPEG_HUFFSYMB43</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x2BC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA172</name>
                <description>Data 172
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA173</name>
                <description>Data 173
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA174</name>
                <description>Data 174
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA175</name>
                <description>Data 175
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB44</name>
            <displayName>JPEG_HUFFSYMB44</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x2C0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA176</name>
                <description>Data 176
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA177</name>
                <description>Data 177
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA178</name>
                <description>Data 178
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA179</name>
                <description>Data 179
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB45</name>
            <displayName>JPEG_HUFFSYMB45</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x2C4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA180</name>
                <description>Data 180
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA181</name>
                <description>Data 181
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA182</name>
                <description>Data 182
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA183</name>
                <description>Data 183
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB46</name>
            <displayName>JPEG_HUFFSYMB46</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x2C8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA184</name>
                <description>Data 184
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA185</name>
                <description>Data 185
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA186</name>
                <description>Data 186
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA187</name>
                <description>Data 187
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFSYMB47</name>
            <displayName>JPEG_HUFFSYMB47</displayName>
            <description>JPEG Huffman symbol</description>
            <addressOffset>0x2CC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA188</name>
                <description>Data 188
Huffman symbol.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA189</name>
                <description>Data 189
Huffman symbol.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA190</name>
                <description>Data 190
Huffman symbol.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA191</name>
                <description>Data 191
Huffman symbol.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
