knieriem/tinygo-stm32-svd/svd/stm32u5gx.svd
          <register>
            <name>JPEG_HUFFENC_AC1_10</name>
            <displayName>JPEG_HUFFENC_AC1_10</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_65</alternateRegister>
            <addressOffset>0x604</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE20</name>
                <description>Huffman code 20
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN20</name>
                <description>Huffman length 20
Number of bits in the Huffman code HCODE20 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE21</name>
                <description>Huffman code 21
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN21</name>
                <description>Huffman length 21
Number of bits in the Huffman code HCODE21 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_66</name>
            <displayName>JPEG_HUFFENC_AC0_66</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x608</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE132</name>
                <description>Huffman code 132
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN132</name>
                <description>Huffman length 132
Number of bits in the Huffman code HCODE132 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE133</name>
                <description>Huffman code 133
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN133</name>
                <description>Huffman length 133
Number of bits in the Huffman code HCODE133 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_11</name>
            <displayName>JPEG_HUFFENC_AC1_11</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_66</alternateRegister>
            <addressOffset>0x608</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE22</name>
                <description>Huffman code 22
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN22</name>
                <description>Huffman length 22
Number of bits in the Huffman code HCODE22 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE23</name>
                <description>Huffman code 23
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN23</name>
                <description>Huffman length 23
Number of bits in the Huffman code HCODE23 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_67</name>
            <displayName>JPEG_HUFFENC_AC0_67</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x60C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE134</name>
                <description>Huffman code 134
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN134</name>
                <description>Huffman length 134
Number of bits in the Huffman code HCODE134 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE135</name>
                <description>Huffman code 135
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN135</name>
                <description>Huffman length 135
Number of bits in the Huffman code HCODE135 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_12</name>
            <displayName>JPEG_HUFFENC_AC1_12</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_67</alternateRegister>
            <addressOffset>0x60C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE24</name>
                <description>Huffman code 24
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN24</name>
                <description>Huffman length 24
Number of bits in the Huffman code HCODE24 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE25</name>
                <description>Huffman code 25
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN25</name>
                <description>Huffman length 25
Number of bits in the Huffman code HCODE25 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_68</name>
            <displayName>JPEG_HUFFENC_AC0_68</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x610</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE136</name>
                <description>Huffman code 136
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN136</name>
                <description>Huffman length 136
Number of bits in the Huffman code HCODE136 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE137</name>
                <description>Huffman code 137
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN137</name>
                <description>Huffman length 137
Number of bits in the Huffman code HCODE137 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_13</name>
            <displayName>JPEG_HUFFENC_AC1_13</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_68</alternateRegister>
            <addressOffset>0x610</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE26</name>
                <description>Huffman code 26
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN26</name>
                <description>Huffman length 26
Number of bits in the Huffman code HCODE26 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE27</name>
                <description>Huffman code 27
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN27</name>
                <description>Huffman length 27
Number of bits in the Huffman code HCODE27 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_69</name>
            <displayName>JPEG_HUFFENC_AC0_69</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x614</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE138</name>
                <description>Huffman code 138
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN138</name>
                <description>Huffman length 138
Number of bits in the Huffman code HCODE138 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE139</name>
                <description>Huffman code 139
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN139</name>
                <description>Huffman length 139
Number of bits in the Huffman code HCODE139 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_14</name>
            <displayName>JPEG_HUFFENC_AC1_14</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_69</alternateRegister>
            <addressOffset>0x614</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE28</name>
                <description>Huffman code 28
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN28</name>
                <description>Huffman length 28
Number of bits in the Huffman code HCODE28 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE29</name>
                <description>Huffman code 29
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN29</name>
                <description>Huffman length 29
Number of bits in the Huffman code HCODE29 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_70</name>
            <displayName>JPEG_HUFFENC_AC0_70</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x618</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE140</name>
                <description>Huffman code 140
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN140</name>
                <description>Huffman length 140
Number of bits in the Huffman code HCODE140 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE141</name>
                <description>Huffman code 141
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN141</name>
                <description>Huffman length 141
Number of bits in the Huffman code HCODE141 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_15</name>
            <displayName>JPEG_HUFFENC_AC1_15</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_70</alternateRegister>
            <addressOffset>0x618</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE30</name>
                <description>Huffman code 30
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN30</name>
                <description>Huffman length 30
Number of bits in the Huffman code HCODE30 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE31</name>
                <description>Huffman code 31
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN31</name>
                <description>Huffman length 31
Number of bits in the Huffman code HCODE31 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_71</name>
            <displayName>JPEG_HUFFENC_AC0_71</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x61C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE142</name>
                <description>Huffman code 142
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN142</name>
                <description>Huffman length 142
Number of bits in the Huffman code HCODE142 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE143</name>
                <description>Huffman code 143
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN143</name>
                <description>Huffman length 143
Number of bits in the Huffman code HCODE143 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
