knieriem/tinygo-stm32-svd/svd/stm32u5gx.svd
        <register>
          <name>R2KEYR1</name>
          <displayName>R2KEYR1</displayName>
          <description>OTFDEC region x key register 1</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REG2_KEY</name>
              <description>REG2_KEY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>R3KEYR1</name>
          <displayName>R3KEYR1</displayName>
          <description>OTFDEC region x key register 1</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REG3_KEY</name>
              <description>REG3_KEY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>R4KEYR1</name>
          <displayName>R4KEYR1</displayName>
          <description>OTFDEC region x key register 1</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REG4_KEY</name>
              <description>REG4_KEY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>R1KEYR2</name>
          <displayName>R1KEYR2</displayName>
          <description>OTFDEC region x key register 2</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REG1_KEY</name>
              <description>REG1_KEY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>R2KEYR2</name>
          <displayName>R2KEYR2</displayName>
          <description>OTFDEC region x key register 2</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REG2_KEY_</name>
              <description>REG2_KEY_</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>R3KEYR2</name>
          <displayName>R3KEYR2</displayName>
          <description>OTFDEC region x key register 2</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REG3_KEY</name>
              <description>REG3_KEY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>R4KEYR2</name>
          <displayName>R4KEYR2</displayName>
          <description>OTFDEC region x key register 2</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REG4_KEY</name>
              <description>REG4_KEY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>R1KEYR3</name>
          <displayName>R1KEYR3</displayName>
          <description>OTFDEC region x key register 3</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REG1_KEY</name>
              <description>REG1_KEY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>R2KEYR3</name>
          <displayName>R2KEYR3</displayName>
          <description>OTFDEC region x key register 3</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REG2_KEY</name>
              <description>REG2_KEY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>R3KEYR3</name>
          <displayName>R3KEYR3</displayName>
          <description>OTFDEC region x key register 3</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REG3_KEY</name>
              <description>REG3_KEY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>R4KEYR3</name>
          <displayName>R4KEYR3</displayName>
          <description>OTFDEC region x key register 3</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REG4_KEY</name>
              <description>REG4_KEY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>OTFDEC interrupt status
          register</description>
          <addressOffset>0x300</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEIF</name>
              <description>Security Error Interrupt Flag
              status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XONEIF</name>
              <description>Execute-only execute-Never Error
              Interrupt Flag status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEIF</name>
              <description>Key Error Interrupt Flag
              status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>ICR</displayName>
          <description>OTFDEC interrupt clear
          register</description>
          <addressOffset>0x304</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEIF</name>
              <description>SEIF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XONEIF</name>
              <description>Execute-only execute-Never Error
              Interrupt Flag clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEIF</name>
              <description>KEIF</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>OTFDEC interrupt enable
          register</description>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEIE</name>
              <description>Security Error Interrupt
              Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XONEIE</name>
              <description>XONEIE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEIE</name>
              <description>KEIE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
