knieriem/tinygo-stm32-svd/svd/stm32u5gx.svd
          <register>
            <name>RCC_APB2SMENR</name>
            <displayName>RCC_APB2SMENR</displayName>
            <description>RCC APB2 peripheral clocks enable in Sleep and Stop modes register</description>
            <addressOffset>0x0CC</addressOffset>
            <size>0x20</size>
            <resetValue>0xFFFFFFFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TIM1SMEN</name>
                <description>TIM1 clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>TIM1 clocks disabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>TIM1 clocks enabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SPI1SMEN</name>
                <description>SPI1 clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SPI1 clocks disabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SPI1 clocks enabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM8SMEN</name>
                <description>TIM8 clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>TIM8 clocks disabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>TIM8 clocks enabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>USART1SMEN</name>
                <description>USART1 clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>USART1clocks disabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>USART1clocks enabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM15SMEN</name>
                <description>TIM15 clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>TIM15 clocks disabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>TIM15 clocks enabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM16SMEN</name>
                <description>TIM16 clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>TIM16 clocks disabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>TIM16 clocks enabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM17SMEN</name>
                <description>TIM17 clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>TIM17 clocks disabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>TIM17 clocks enabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SAI1SMEN</name>
                <description>SAI1 clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SAI1 clocks disabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SAI1 clocks enabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SAI2SMEN</name>
                <description>SAI2 clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series.Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SAI2 clocks disabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SAI2 clocks enabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>USBSMEN</name>
                <description>USB clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>USB clocks disabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>USB clocks enabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GFXTIMSMEN</name>
                <description>GFXTIM clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>GFXTIM clocks disabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>GFXTIM clocks enabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LTDCSMEN</name>
                <description>LTDC clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>LTDC clocks disabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LTDC clocks enabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DSISMEN</name>
                <description>DSI clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>DSI clocks disabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>DSI clocks enabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
