knieriem/tinygo-stm32-svd/svd/stm32u5gx.svd
          <register>
            <name>RCC_SRDAMR</name>
            <displayName>RCC_SRDAMR</displayName>
            <description>RCC SmartRun domain peripheral autonomous mode register</description>
            <addressOffset>0x0D8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SPI3AMEN</name>
                <description>SPI3 autonomous mode enable in Stop 0,1, 2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SPI3 autonomous mode disabled during Stop 0/1/2 mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SPI3 autonomous mode enabled during Stop 0/1/2 mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPUART1AMEN</name>
                <description>LPUART1 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>LPUART1 autonomous mode disabled during Stop 0/1/2 mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LPUART1 autonomous mode enabled during Stop 0/1/2 mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C3AMEN</name>
                <description>I2C3 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>I2C3 autonomous mode disabled during Stop 0/1/2 mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I2C3 autonomous mode enabled during Stop 0/1/2 mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPTIM1AMEN</name>
                <description>LPTIM1 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>LPTIM1 autonomous mode disabled during Stop 0/1/2 mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LPTIM1 autonomous mode enabled during Stop 0/1/2 mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPTIM3AMEN</name>
                <description>LPTIM3 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>LPTIM3 autonomous mode disabled during Stop 0/1/2 mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LPTIM3 autonomous mode enabled during Stop 0/1/2 mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPTIM4AMEN</name>
                <description>LPTIM4 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>LPTIM4 autonomous mode disabled during Stop 0/1/2 mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LPTIM4 autonomous mode enabled during Stop 0/1/2 mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OPAMPAMEN</name>
                <description>OPAMP autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>OPAMP autonomous mode disabled during Stop 0/1/2 mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>OPAMP autonomous mode enabled during Stop 0/1/2 mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>COMPAMEN</name>
                <description>COMP autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>COMP autonomous mode disabled during Stop 0/1/2 mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>COMP autonomous mode enabled during Stop 0/1/2 mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VREFAMEN</name>
                <description>VREFBUF autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>VREFBUF autonomous mode disabled during Stop 0/1/2 mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>VREFBUF autonomous mode enabled during Stop 0/1/2 mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RTCAPBAMEN</name>
                <description>RTC and TAMP autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>RTC and TAMP autonomous mode disabled during Stop 0/1/2mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>RTC and TAMP autonomous mode enabled during Stop 0/1/2 mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ADC4AMEN</name>
                <description>ADC4 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>ADC4 autonomous mode disabled during Stop 0/1/2 mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>ADC4 autonomous mode enabled during Stop 0/1/2 mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPGPIO1AMEN</name>
                <description>LPGPIO1 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>LPGPIO1 autonomous mode disabled during Stop 0/1/2 mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LPGPIO1 autonomous mode enabled during Stop 0/1/2 mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DAC1AMEN</name>
                <description>DAC1 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>DAC1 autonomous mode disabled during Stop 0/1/2 mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>DAC1 autonomous mode enabled during Stop 0/1/2 mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPDMA1AMEN</name>
                <description>LPDMA1 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>LPDMA1 autonomous mode disabled during Stop 0/1/2 mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LPDMA1 autonomous mode enabled during Stop 0/1/2 mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ADF1AMEN</name>
                <description>ADF1 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>ADF1 autonomous mode disabled during Stop 0/1/2 mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>ADF1 autonomous mode enabled during Stop 0/1/2 mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRAM4AMEN</name>
                <description>SRAM4 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SRAM4 autonomous mode disabled during Stop 0/1/2 mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SRAM4 autonomous mode enabled during Stop 0/1/2 mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
